# Importing Modules

In [5]:
import pandas as pd 
import numpy as np
import matplotlib.pyplot as plt

# Greating Pandas Series

In [6]:
s=pd.Series([1,3,5,np.nan,6,8])

In [8]:
print(s)

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

# Creatin Range of Date

In [9]:
dates=pd.date_range('20130101',periods=6)

In [10]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

# Creating Data Frame with Pandas

In [11]:
df=pd.DataFrame(np.random.randn(6,4),index=dates, columns=list('ABCD'))

In [12]:
df

                   A         B         C         D
2013-01-01 -0.106904 -2.164762  1.093553  1.973600
2013-01-02  0.176270  2.251476 -0.987833  1.620066
2013-01-03  1.288420  0.300508  1.432168  0.404163
2013-01-04 -1.671462 -0.677244  0.123711 -0.986858
2013-01-05 -1.703978  0.558248 -0.873963  1.091610
2013-01-06 -0.027740  0.057448  0.117940  0.826813

# Creating Data Frame using Dictionary

In [13]:
df2 = pd.DataFrame({ 'A' : 1.,
                     'B' : pd.Timestamp('20130102'),
                     'C' : pd.Series(1,index=list(range(4)),dtype='float32'),
                     'D' : np.array([3] * 4,dtype='int32'),
                     'E' : pd.Categorical(["test","train","test","train"]),
                     'F' : 'foo' })
    
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [14]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [15]:
df.head()

                   A         B         C         D
2013-01-01 -0.106904 -2.164762  1.093553  1.973600
2013-01-02  0.176270  2.251476 -0.987833  1.620066
2013-01-03  1.288420  0.300508  1.432168  0.404163
2013-01-04 -1.671462 -0.677244  0.123711 -0.986858
2013-01-05 -1.703978  0.558248 -0.873963  1.091610

In [16]:
df.tail(3)

                   A         B         C         D
2013-01-04 -1.671462 -0.677244  0.123711 -0.986858
2013-01-05 -1.703978  0.558248 -0.873963  1.091610
2013-01-06 -0.027740  0.057448  0.117940  0.826813

In [17]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [18]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [19]:
df.values

array([[-0.10690419, -2.16476244,  1.0935529 ,  1.97360018],
       [ 0.17627024,  2.2514764 , -0.98783258,  1.62006567],
       [ 1.28842038,  0.30050818,  1.43216817,  0.40416278],
       [-1.67146211, -0.67724398,  0.12371081, -0.98685804],
       [-1.70397785,  0.55824765, -0.87396265,  1.09160985],
       [-0.02774036,  0.05744811,  0.11793981,  0.82681295]])

In [20]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.340899  0.054279  0.150929  0.821566
std    1.157873  1.456130  0.987838  1.047125
min   -1.703978 -2.164762 -0.987833 -0.986858
25%   -1.280323 -0.493571 -0.625987  0.509825
50%   -0.067322  0.178978  0.120825  0.959211
75%    0.125268  0.493813  0.851092  1.487952
max    1.288420  2.251476  1.432168  1.973600

# Doing a transpose on dataframe

In [23]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -0.106904    0.176270    1.288420   -1.671462   -1.703978   -0.027740
B   -2.164762    2.251476    0.300508   -0.677244    0.558248    0.057448
C    1.093553   -0.987833    1.432168    0.123711   -0.873963    0.117940
D    1.973600    1.620066    0.404163   -0.986858    1.091610    0.826813

In [24]:
df.sort_index(axis=1,ascending=False)

                   D         C         B         A
2013-01-01  1.973600  1.093553 -2.164762 -0.106904
2013-01-02  1.620066 -0.987833  2.251476  0.176270
2013-01-03  0.404163  1.432168  0.300508  1.288420
2013-01-04 -0.986858  0.123711 -0.677244 -1.671462
2013-01-05  1.091610 -0.873963  0.558248 -1.703978
2013-01-06  0.826813  0.117940  0.057448 -0.027740

In [25]:
df.sort_values(by='B')

                   A         B         C         D
2013-01-01 -0.106904 -2.164762  1.093553  1.973600
2013-01-04 -1.671462 -0.677244  0.123711 -0.986858
2013-01-06 -0.027740  0.057448  0.117940  0.826813
2013-01-03  1.288420  0.300508  1.432168  0.404163
2013-01-05 -1.703978  0.558248 -0.873963  1.091610
2013-01-02  0.176270  2.251476 -0.987833  1.620066

In [26]:
df['A']

2013-01-01   -0.106904
2013-01-02    0.176270
2013-01-03    1.288420
2013-01-04   -1.671462
2013-01-05   -1.703978
2013-01-06   -0.027740
Freq: D, Name: A, dtype: float64

# Slicing Dataframe

In [27]:
df[0:3]

                   A         B         C         D
2013-01-01 -0.106904 -2.164762  1.093553  1.973600
2013-01-02  0.176270  2.251476 -0.987833  1.620066
2013-01-03  1.288420  0.300508  1.432168  0.404163

In [28]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02  0.176270  2.251476 -0.987833  1.620066
2013-01-03  1.288420  0.300508  1.432168  0.404163
2013-01-04 -1.671462 -0.677244  0.123711 -0.986858

In [27]:
df.loc[dates[0]]

A    0.937697
B    1.019551
C    0.770225
D   -0.469079
Name: 2013-01-01 00:00:00, dtype: float64

In [29]:
df.loc[:,['A','B']]

                   A         B
2013-01-01  0.937697  1.019551
2013-01-02  0.524662  1.101400
2013-01-03  0.586007  0.201298
2013-01-04  0.731736 -0.237567
2013-01-05 -1.128304  0.761615
2013-01-06  1.986646  0.437345

In [30]:
df.loc['20130102':'20130104',['A','B']]

                   A         B
2013-01-02  0.524662  1.101400
2013-01-03  0.586007  0.201298
2013-01-04  0.731736 -0.237567

In [31]:
df.loc[dates[0],'A']

0.93769684250884322

In [32]:
df.at[dates[0],'A']

0.93769684250884322

In [33]:
df.iloc[3]

A    0.731736
B   -0.237567
C    0.863924
D   -0.191227
Name: 2013-01-04 00:00:00, dtype: float64

In [34]:
df.iloc[3:5,0:2]

                   A         B
2013-01-04  0.731736 -0.237567
2013-01-05 -1.128304  0.761615

In [36]:
df.iloc[[1,2,4],[0,2]]

                   A         C
2013-01-02  0.524662  0.048861
2013-01-03  0.586007  0.417067
2013-01-05 -1.128304 -0.285964

In [37]:
df.iloc[:,1:3]

                   B         C
2013-01-01  1.019551  0.770225
2013-01-02  1.101400  0.048861
2013-01-03  0.201298  0.417067
2013-01-04 -0.237567  0.863924
2013-01-05  0.761615 -0.285964
2013-01-06  0.437345 -0.976610

In [38]:
df.iloc[1:3,:]

                   A         B         C         D
2013-01-02  0.524662  1.101400  0.048861  0.636243
2013-01-03  0.586007  0.201298  0.417067  1.528645

In [39]:
df.iloc[1,1]

1.1014000523863428

In [40]:
df.iat[1,1]

1.1014000523863428

In [41]:
df[df.A>0]

                   A         B         C         D
2013-01-01  0.937697  1.019551  0.770225 -0.469079
2013-01-02  0.524662  1.101400  0.048861  0.636243
2013-01-03  0.586007  0.201298  0.417067  1.528645
2013-01-04  0.731736 -0.237567  0.863924 -0.191227
2013-01-06  1.986646  0.437345 -0.976610 -0.331948

In [42]:
df[df>0]

                   A         B         C         D
2013-01-01  0.937697  1.019551  0.770225       NaN
2013-01-02  0.524662  1.101400  0.048861  0.636243
2013-01-03  0.586007  0.201298  0.417067  1.528645
2013-01-04  0.731736       NaN  0.863924       NaN
2013-01-05       NaN  0.761615       NaN  1.131137
2013-01-06  1.986646  0.437345       NaN       NaN

In [43]:
df.mean()

A    0.606407
B    0.547274
C    0.139584
D    0.383962
dtype: float64

In [44]:
df.mean(1)

2013-01-01    0.564598
2013-01-02    0.577791
2013-01-03    0.683254
2013-01-04    0.291717
2013-01-05    0.119621
2013-01-06    0.278858
Freq: D, dtype: float64